Repository: shehabmohamed0/bimarestan
Catalog: lib/localizations/l10n/intl_*.arb
Languages: ar

# bad_request_response_message
source: Bad Request
ar: ResponseMessage.BAD_REQUEST

# forbidden_response_message
source: Forbidden
ar: ResponseMessage.FORBIDDEN

# unauthorized_response_message
source: Unauthorized
ar: ResponseMessage.UNAUTORISED

# not_found_response_message
source: Not Found
ar: ResponseMessage.NOT_FOUND

# internal_server_error_response_message
source: Internal Server Error
ar: ResponseMessage.INTERNAL_SERVER_ERROR

# connect_timeout_response_message
source: Connection Timeout
ar: ResponseMessage.CONNECT_TIMEOUT

# cancel_response_message
source: Canceled
ar: ResponseMessage.CANCEL

# recieve_timeout_response_message
source: Recieve Timeout
ar: ResponseMessage.RECIEVE_TIMEOUT

# send_timeout_response_message
source: Send Timeout
ar: ResponseMessage.SEND_TIMEOUT

# cache_error_response_message
source: Cache Error
ar: ResponseMessage.CACHE_ERROR

# not_internet_connection_response_message
source: No Internet Connection
ar: ResponseMessage.NO_INTERNET_CONNECTION

# default_response_message
source: Something went wrong
ar: ResponseMessage.DEFAULT
